package com.greenfieldxd.easybalance.data.repository

data class Category(
    val name: String,
    val keywords: List<String>
)

object CategoryDataSource {
    val categories = listOf(
        Category(
            "Продукты",
            listOf(
                "еда", "магазин", "продукты", "супермаркет", "хлеб", "молоко",
                "фрукты", "овощи", "мясо", "рыба", "сыр", "напитки", "бакалея", "морепродукты"
            )
        ),
        Category(
            "Транспорт",
            listOf(
                "метро", "автобус", "такси", "бензин", "троллейбус", "поезд", "билеты",
                "велосипед", "самокат", "авиабилет", "каршеринг", "маршрутка", "ж/д"
            )
        ),
        Category(
            "Развлечения",
            listOf(
                "кино", "игры", "путешествия", "концерт", "театр", "аттракционы", "парки",
                "вечеринка", "музей", "квест", "фестиваль", "караоке", "дискотека"
            )
        ),
        Category(
            "Здоровье",
            listOf(
                "аптека", "лекарства", "витамины", "больница", "доктор", "медосмотр",
                "стоматолог", "анализы", "медицина", "поликлиника", "медикаменты", "лечебница"
            )
        ),
        Category(
            "Спорт",
            listOf(
                "тренировка", "спортзал", "фитнес", "бассейн", "йога", "бег", "футбол",
                "баскетбол", "спортинвентарь", "стадион", "тренер", "физкультура"
            )
        ),
        Category(
            "Образование",
            listOf(
                "курсы", "школа", "университет", "репетитор", "книги", "учебники",
                "онлайн-обучение", "образование", "семинар", "лекция", "мастер-класс", "тренинг"
            )
        ),
        Category(
            "Коммунальные услуги",
            listOf(
                "электричество", "вода", "газ", "интернет", "аренда", "ЖКХ", "тепло",
                "свет", "коммуналка", "счет", "оплата", "расходы", "мусор"
            )
        ),
        Category(
            "Дом и ремонт",
            listOf(
                "мебель", "ремонт", "стройматериалы", "инструменты", "лампы", "гвозди",
                "шурупы", "отделка", "дизайн", "интерьер", "сантехника", "электрика", "строительство"
            )
        ),
        Category(
            "Одежда и аксессуары",
            listOf(
                "одежда", "обувь", "платье", "костюм", "часы", "рюкзак", "сумка", "шапка",
                "футболка", "джинсы", "блузка", "аксессуары", "пальто"
            )
        ),
        Category(
            "Красота и уход",
            listOf(
                "косметика", "маникюр", "парикмахер", "крем", "духи", "массаж", "салон",
                "уход", "стрижка", "эпиляция", "макияж", "бьюти"
            )
        ),
        Category(
            "Домашние животные",
            listOf(
                "зоомагазин", "корм", "ветеринар", "игрушки", "аквариум", "кошачий наполнитель",
                "питомец", "собака", "кошка", "грызун", "птичка", "животные", "зоотовары"
            )
        ),
        Category(
            "Кафе и рестораны",
            listOf(
                "ресторан", "кафе", "бар", "фастфуд", "кофе", "чай",
                "заведение", "столовая", "фудтрак", "фуд-корт", "кухня", "закуски", "еды"
            )
        ),
        Category(
            "Подарки",
            listOf(
                "подарок", "цветы", "сюрприз", "сувенир", "упаковка", "праздник", "подарочная", "сувенир", "подарки"
            )
        ),
        Category(
            "Электроника и бытовая техника",
            listOf(
                "смартфон", "ноутбук", "компьютер", "телевизор", "планшет", "аксессуары",
                "гарнитура", "наушники", "гаджет", "консоль", "фотоаппарат",
                "холодильник", "стиральная машина", "посудомоечная", "микроволновка",
                "пылесос", "кондиционер", "плита", "духовка", "техника", "бытовая"
            )
        ),
        Category(
            "Подписки и сервисы",
            listOf(
                "подписка", "netflix", "spotify", "hbo", "apple music", "сервис", "премиум", "онлайн-сервис", "подписки"
            )
        ),
        Category(
            "Страхование",
            listOf(
                "страховка", "страхование", "полис", "страховщик", "автострахование", "медстраховка"
            )
        ),
        Category(
            "Доход",
            listOf(
                "зарплата", "зп", "наличные", "наличка", "бонус", "премия", "вознаграждение", "доход", "приход", "выплата", "прибыль", "пособие", "подработка"
            )
        ),
        Category(
            "Разное",
            listOf(
                "прочее", "разное", "другое", "неопределено", "иное"
            )
        )
    )
}
