package com.greenfieldxd.easybalance.data.repository

object CategoryDefaultDataSource {
    val categories = listOf(
        CategoryData(
            "Продукты",
            listOf(
                "Еда", "Магазин", "Продукты", "Супермаркет", "Хлеб", "Молоко",
                "Фрукты", "Овощи", "Мясо", "Рыба", "Сыр", "Напитки", "Бакалея", "Морепродукты"
            )
        ),
        CategoryData(
            "Транспорт",
            listOf(
                "Метро", "Автобус", "Такси", "Бензин", "Троллейбус", "Поезд", "Билеты",
                "Велосипед", "Самокат", "Авиабилет", "Каршеринг", "Маршрутка", "Ж/Д"
            )
        ),
        CategoryData(
            "Развлечения",
            listOf(
                "Кино", "Игры", "Путешествия", "Концерт", "Театр", "Аттракционы", "Парки",
                "Вечеринка", "Музей", "Квест", "Фестиваль", "Караоке", "Дискотека"
            )
        ),
        CategoryData(
            "Здоровье",
            listOf(
                "Аптека", "Лекарства", "Витамины", "Больница", "Доктор", "Медосмотр",
                "Стоматолог", "Анализы", "Медицина", "Поликлиника", "Медикаменты", "Лечебница"
            )
        ),
        CategoryData(
            "Спорт",
            listOf(
                "Тренировка", "Спортзал", "Фитнес", "Бассейн", "Йога", "Бег", "Футбол",
                "Баскетбол", "Спортинвентарь", "Стадион", "Тренер", "Физкультура"
            )
        ),
        CategoryData(
            "Образование",
            listOf(
                "Курсы", "Школа", "Университет", "Репетитор", "Книги", "Учебники",
                "Онлайн-обучение", "Образование", "Семинар", "Лекция", "Мастер-класс", "Тренинг"
            )
        ),
        CategoryData(
            "Коммунальные услуги",
            listOf(
                "Электричество", "Вода", "Газ", "Интернет", "Аренда", "ЖКХ", "Тепло",
                "Свет", "Коммуналка", "Счет", "Оплата", "Расходы", "Мусор"
            )
        ),
        CategoryData(
            "Дом и ремонт",
            listOf(
                "Мебель", "Ремонт", "Стройматериалы", "Инструменты", "Лампы", "Гвозди",
                "Шурупы", "Отделка", "Дизайн", "Интерьер", "Сантехника", "Электрика", "Строительство"
            )
        ),
        CategoryData(
            "Одежда и аксессуары",
            listOf(
                "Одежда", "Обувь", "Платье", "Костюм", "Часы", "Рюкзак", "Сумка", "Шапка",
                "Футболка", "Джинсы", "Блузка", "Аксессуары", "Пальто"
            )
        ),
        CategoryData(
            "Красота и уход",
            listOf(
                "Косметика", "Маникюр", "Парикмахер", "Крем", "Духи", "Массаж", "Салон",
                "Уход", "Стрижка", "Эпиляция", "Макияж", "Бьюти"
            )
        ),
        CategoryData(
            "Домашние животные",
            listOf(
                "Зоомагазин", "Корм", "Ветеринар", "Игрушки", "Аквариум", "Кошачий наполнитель",
                "Питомец", "Собака", "Кошка", "Грызун", "Птичка", "Животные", "Зоотовары"
            )
        ),
        CategoryData(
            "Кафе и рестораны",
            listOf(
                "Ресторан", "Кафе", "Бар", "Фастфуд", "Кофе", "Чай",
                "Заведение", "Столовая", "Фудтрак", "Фуд-корт", "Кухня", "Закуски", "Еда"
            )
        ),
        CategoryData(
            "Подарки",
            listOf(
                "Подарок", "Цветы", "Сюрприз", "Сувенир", "Упаковка", "Праздник", "Подарочная"
            )
        ),
        CategoryData(
            "Электроника и бытовая техника",
            listOf(
                "Смартфон", "Ноутбук", "Компьютер", "Телевизор", "Планшет", "Аксессуары",
                "Гарнитура", "Наушники", "Гаджет", "Консоль", "Фотоаппарат",
                "Холодильник", "Стиральная машина", "Посудомоечная", "Микроволновка",
                "Пылесос", "Кондиционер", "Плита", "Духовка", "Техника", "Бытовая"
            )
        ),
        CategoryData(
            "Подписки и сервисы",
            listOf(
                "Подписка", "Netflix", "Spotify", "HBO", "Apple Music", "Сервис", "Премиум", "Онлайн-сервис"
            )
        ),
        CategoryData(
            "Страхование",
            listOf(
                "Страховка", "Страхование", "Полис", "Страховщик", "Автострахование", "Медстраховка"
            )
        ),
        CategoryData(
            "Доход",
            listOf(
                "Зарплата", "ЗП", "Наличные", "Наличка", "Бонус", "Премия", "Вознаграждение", "Доход", "Приход", "Выплата", "Прибыль", "Пособие", "Подработка"
            )
        ),
        CategoryData(
            "Разное",
            listOf(
                "Прочее", "Разное", "Другое", "Неопределено", "Иное"
            )
        )
    )
}